In [214]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter
print(os.listdir("./imdb"))

['data.csv']

In [215]:
data = pd.read_csv('./imdb/data.csv')
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [216]:
len(data)

1890

# Предобработка датасета

In [217]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [218]:
data[data.budget == data.budget.max()][["original_title"]].head()

        original_title
491  The Warrior's Way

In [219]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [220]:
data[["original_title", "runtime"]].sort_values(by = "runtime", ascending=False).head()

                                     original_title  runtime
1158                              Gods and Generals      214
1082  The Lord of the Rings: The Return of the King      201
1737                                     Grindhouse      191
1337                                      King Kong      187
505                                    Pearl Harbor      183

In [221]:
answer_ls.append(2)

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [222]:
data[["original_title", "runtime"]].sort_values(by = "runtime", ascending=True).head()

            original_title  runtime
769        Winnie the Pooh       63
931   Return to Never Land       72
1098     The Jungle Book 2       72
1627     Home on the Range       76
1409               Valiant       76

In [223]:
answer_ls.append(3)

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [224]:
data[["original_title", "runtime"]].mean()

runtime    109.653439
dtype: float64

In [225]:
answer_ls.append(2)

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [226]:
data[["original_title", "runtime"]].median()

runtime    106.5
dtype: float64

In [227]:
answer_ls.append(1)

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [228]:
# data[["original_title", "budget", "revenue"]]
data["profit"] = data["revenue"] - data["budget"]
data[["original_title", "profit"]].sort_values(by = "profit", ascending=False).head()

                   original_title      profit
239                        Avatar  2544505847
3    Star Wars: The Force Awakens  1868178225
0                  Jurassic World  1363528810
4                       Furious 7  1316249360
971                  The Avengers  1299557910

In [229]:
answer_ls.append(5)

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [230]:
data[["original_title", "profit"]].sort_values(by = "profit", ascending=True).head()

                    original_title     profit
491              The Warrior's Way -413912431
1246               The Lone Ranger -165710090
1617                     The Alamo -119180039
810                Mars Needs Moms -111007242
959   The Adventures of Pluto Nash  -92896027

In [231]:
answer_ls.append(2)

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [232]:
len(data[data.profit>0])

1478

In [233]:
answer_ls.append(1)

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [234]:
data[(data.profit > 0) & (data.release_year == 2008)][["original_title", "release_year", "profit"]].sort_values(by = "profit", ascending = False)

,original_title,release_year,profit
600,The Dark Knight,2008,816921825
604,Indiana Jones and the Kingdom of the Crystal S...,2008,601636033
608,Mamma Mia!,2008,557841637
607,Kung Fu Panda,2008,501744560
622,Hancock,2008,474029371
...,...,...,...
708,Lakeview Terrace,2008,7640028
718,Igor,2008,5000000
715,W.,2008,4406464
716,Smart People,2008,3569964
658,Babylon A.D.,2008,2108608

In [235]:
answer_ls.append(4)

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [236]:
data[(data.release_year >= 2012) & (data.release_year < 2014)][["original_title", "release_year", "profit"]].sort_values(by = "profit", ascending = True)

                       original_title  release_year      profit
1246                  The Lone Ranger          2013  -165710090
1215                         R.I.P.D.          2013   -68351500
1008                      Upside Down          2012   -51893525
1303  Legends of Oz: Dorothy's Return          2013   -51337973
1236               Bullet to the Head          2013   -45510171
...                               ...           ...         ...
1190                  Despicable Me 2          2013   894761885
975                           Skyfall          2012   908561013
1181                       Iron Man 3          2013  1015439994
1178                           Frozen          2013  1124219009
971                      The Avengers          2012  1299557910

[246 rows x 3 columns]

In [237]:
answer_ls.append(5)

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [238]:
pd.Series(np.concatenate([x.split("|") for x in data.genres.array])).value_counts().head()

Drama        782
Comedy       683
Thriller     597
Action       583
Adventure    416
dtype: int64

In [239]:
answer_ls.append(3)

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [240]:
pd.Series(np.concatenate([x.split("|") for x in data[data.profit>0].genres.array])).value_counts().head()

Drama        560
Comedy       551
Thriller     446
Action       444
Adventure    337
dtype: int64

In [241]:
answer_ls.append(1)

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [242]:
data.director.value_counts().head()

Steven Soderbergh    13
Clint Eastwood       12
Ridley Scott         12
Shawn Levy           10
Steven Spielberg     10
Name: director, dtype: int64

In [243]:
answer_ls.append(3)

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [244]:
data[data.profit>0].director.value_counts().head()

Ridley Scott         12
Clint Eastwood       10
Steven Soderbergh    10
Steven Spielberg     10
Shawn Levy            9
Name: director, dtype: int64

In [245]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [246]:
data[["director", "profit"]].groupby("director").sum().sort_values(by="profit", ascending = False).head()

                       profit
director
Peter Jackson      5202593685
David Yates        3379295625
Christopher Nolan  3162548502
J.J. Abrams        2839169916
Michael Bay        2760938960

In [247]:
answer_ls.append(5)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [248]:
actors = pd.DataFrame(data.cast.str.split("|").tolist(), index = data.profit).stack()
actors = actors.reset_index([0, "profit"])
actors.columns = ["profit", "actor"]
actors.groupby("actor").sum().sort_values(by = "profit", ascending = False)

                        profit
actor
Emma Watson         6666245597
Daniel Radcliffe    6514990281
Rupert Grint        6408638290
Ian McKellen        6087375777
Robert Downey Jr.   5316030161
...                        ...
Elisabeth Harnois   -111007242
Emilio EchevarrÃ­a  -119180039
Kate Bosworth       -369455668
Jang Dong-gun       -413912431
Ti Lung             -413912431

[3408 rows x 1 columns]

In [249]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [250]:
actors = pd.DataFrame(data.cast.str.split("|").tolist(), index = [data.profit, data.release_year]).stack()
actors = actors.reset_index([0, "profit", "release_year"])
actors.columns = ["profit", "release_year", "actor"]
actors[actors.release_year == 2012].groupby("actor").sum().sort_values(by = "profit", ascending = True)

                       profit  release_year
actor
Kirsten Dunst       -68109207          4024
Heidi Hawkins       -51893525          2012
James Kidnie        -51893525          2012
Timothy Spall       -51893525          2012
Malin Ã…kerman      -43733509          4024
...                       ...           ...
Robert Downey Jr.  1299557910          2012
Mark Ruffalo       1299557910          2012
Chris Evans        1299557910          2012
Denis Leary        1319460639          4024
Chris Hemsworth    1542450773          8048

[466 rows x 2 columns]

In [251]:
answer_ls.append(3)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [252]:
actors = pd.DataFrame(data.cast.str.split("|").tolist(), index = data.budget).stack()
actors = actors.reset_index([0, "budget"])
actors.columns = ["budget", "actor"]
actors[actors.budget > actors.budget.mean()].groupby("actor").count().sort_values(by = "budget", ascending = False).head()

                   budget
actor
Matt Damon             18
Adam Sandler           17
Angelina Jolie         16
Samuel L. Jackson      15
Tom Cruise             15

In [253]:
answer_ls.append(3)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [254]:
pd.Series(np.concatenate([x.split("|") for x in data[data.cast.str.contains("Nicolas Cage")].genres.array])).value_counts().head()

Action      17
Thriller    15
Drama       12
Crime       10
Fantasy      8
dtype: int64

In [255]:
answer_ls.append(2)

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [256]:
companies = data.copy()
companies.production_companies = data.production_companies.str.split("|")
comp_df = companies.explode("production_companies")

In [257]:
comp_df.production_companies.value_counts().head()

Universal Pictures                        173
Warner Bros.                              168
Paramount Pictures                        122
Columbia Pictures                         117
Twentieth Century Fox Film Corporation    109
Name: production_companies, dtype: int64

In [258]:
answer_ls.append(1)

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [259]:
comp_df.query("release_year == 2015").production_companies.value_counts().head()

Warner Bros.                              12
Universal Pictures                        10
Twentieth Century Fox Film Corporation     8
Paramount Pictures                         7
Columbia Pictures                          7
Name: production_companies, dtype: int64

answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [260]:
comp_genre = comp_df.copy()
comp_genre.genres = comp_df.genres.str.split("|")
comp_genre_df = comp_genre.explode("genres")
comp_genre_df[comp_genre_df.genres == "Comedy"][["production_companies", "profit"]].groupby("production_companies").sum().sort_values(by="profit", ascending=False)

                                             profit
production_companies
Universal Pictures                      27851178365
Twentieth Century Fox Film Corporation  18662644250
Walt Disney Pictures                    17845854898
Columbia Pictures                       16966099241
Warner Bros.                            15682759228
...                                             ...
80 Days Productions                      -189105525
Dark Horse Entertainment                 -205054500
Road Rebel                               -213993279
Shangri-La Entertainment                 -220683144
Mel's Cite du Cinema                     -371584108

[702 rows x 1 columns]

In [261]:
answer_ls.append(2)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [262]:
comp_genre_df[comp_genre_df.release_year == 2012][["production_companies", "profit"]].groupby("production_companies").sum().sort_values(by="profit", ascending = False)

                           profit
production_companies
Columbia Pictures     16501929386
Warner Bros.          16074896786
Universal Pictures    15909256088
Relativity Media      14120152087
Legendary Pictures    14051660592
...                           ...
Jouror Productions    -1037870500
Transfilm             -1037870500
Studio 37             -1037870500
Onyx Films            -1037870500
France 2 CinÃ©ma      -1272209540

[236 rows x 1 columns]

In [263]:
answer_ls.append(3)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [264]:
comp_genre_df[comp_genre_df.production_companies=="Paramount Pictures"].sort_values(by="profit").head(1)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,profit
926,tt0267626,0.72233,100000000,35168966,K-19: The Widowmaker,Harrison Ford|Liam Neeson|Peter Sarsgaard|Joss...,Kathryn Bigelow,Fate has found its hero.,When Russia's first nuclear submarine malfunct...,138,Drama,Paramount Pictures,7/19/2002,146,6.0,2002,-64831034

In [265]:
answer_ls.append(1)

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [266]:
data[["release_year", "profit"]].groupby("release_year").sum().sort_values(by="profit", ascending=False)

                   profit
release_year
2015          18668572378
2014          16397812953
2012          16077001687
2013          15243179791
2011          14730241341
2009          13423744372
2010          13117292530
2008          11663881990
2007          11565911801
2004           9634180720
2003           9228823312
2002           9002361487
2005           8981925558
2006           8691077320
2001           7950614865
2000           6101399805

In [267]:
answer_ls.append(5)

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [268]:
comp_df[comp_df.production_companies.str.contains("Warner")][["release_year", "profit"]].groupby("release_year").sum().sort_values(by="profit", ascending=False)

                  profit
release_year
2014          2292949646
2007          2208217007
2008          2134595031
2010          1974712985
2011          1871393682
2003          1844008221
2009          1822454136
2013          1636453400
2004          1631933725
2005          1595278228
2001          1282142579
2012          1258020056
2002          1022709901
2015           870368348
2006           622332868
2000           452631386

In [269]:
answer_ls.append(1)

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [271]:
from datetime import datetime
data["release_month"] = data.release_date.apply(lambda d: datetime.strptime(d, "%m/%d/%Y").month)

In [275]:
data[["release_month", "original_title"]].groupby("release_month").count().sort_values(by="original_title")

               original_title
release_month
1                         110
2                         135
5                         140
7                         142
11                        146
6                         147
4                         149
3                         156
8                         161
10                        186
12                        191
9                         227

In [276]:
answer_ls.append(4)

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [282]:
data[["release_month", "original_title"]].query("release_month in [6,7,8]").count()

release_month     450
original_title    450
dtype: int64

In [283]:
answer_ls.append(2)

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [286]:
data.query("release_month in [1,2,12]").director.value_counts()

Peter Jackson        7
Steven Soderbergh    6
Clint Eastwood       6
Martin Scorsese      4
Shawn Levy           4
                    ..
Will Gluck           1
David Frankel        1
Jeremy Garelick      1
Jonathan Levine      1
Chris Weitz          1
Name: director, Length: 333, dtype: int64

In [ ]:
answer_ls.append(5)

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [290]:
data[["release_month", "profit"]].groupby("release_month").sum().sort_values(by="profit", ascending=False)

                    profit
release_month
6              27551262500
12             26563071474
5              25039516141
11             18654155473
7              18307895020
3              13720216540
10             12994907859
4              12876005537
9              10878921041
8               9640610446
2               8854574425
1               5396885454

In [292]:
answer_ls.append(2)

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [312]:
comp_df["title_len"] = comp_df.original_title.apply(lambda x: len(x))
comp_df[["production_companies", "title_len"]].groupby("production_companies").mean().sort_values(by="title_len", ascending=False)

                            title_len
production_companies
Four By Two Productions          83.0
Jim Henson Company, The          59.0
Dos Corazones                    47.0
Polsky Films                     46.0
Museum Canada Productions        46.0
...                               ...
Everest Entertainment             3.0
Berlanti Productions              3.0
Global Entertainment Group        2.0
XM2 Productions                   2.0
Ixtlan Productions                2.0

[1772 rows x 1 columns]

In [313]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [318]:
comp_df["title_words_count"] = comp_df.original_title.apply(lambda x: len(x.split()))
comp_df[["production_companies", "title_words_count"]].groupby("production_companies").mean().sort_values(by="title_words_count", ascending=False)

                         title_words_count
production_companies
Four By Two Productions               12.0
Jim Henson Company, The               10.0
Dos Corazones                          9.0
Polsky Films                           9.0
The Saul Zaentz Company                9.0
...                                    ...
Jolie Pas                              1.0
Frantic Films                          1.0
Outpost Studios                        1.0
Cinelou Films                          1.0
Danjaq                                 1.0

[1772 rows x 1 columns]

In [319]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [333]:
words = data.original_title.apply(lambda x: x.lower().split())
words.explode().nunique()

2461

In [329]:
answer_ls.append(3)

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [367]:
data[["original_title", "vote_average"]].nlargest(int(len(data)/100), "vote_average")

                                     original_title  vote_average
600                                 The Dark Knight           8.1
9                                        Inside Out           8.0
34                                             Room           8.0
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
119                         Guardians of the Galaxy           7.9
128                                       Gone Girl           7.9
138                        The Grand Budapest Hotel           7.9
370                                       Inception           7.9
873                                     The Pianist           7.9
1082  The Lord of the Rings: The Return of the King           7.9
1184                        The Wolf of Wall Street           7.9
1192                               12 Years a Slave           7.9
1801                                        Memento           7.9
28                                        Spotlight           7.8
124                                      Big Hero 6           7.8
155                        The Theory of Everything           7.8
177                          The Fault in Our Stars           7.8

In [368]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [456]:
actor_sets = [["Johnny Depp","Helena Bonham Carter"], ["Hugh Jackman","Ian McKellen"], ["Vin Diesel","Paul Walker"], ["Adam Sandler","Kevin James"], ["Daniel Radcliffe","Rupert Grint"]]
result = pd.Series()
for set in actor_sets:
    common_films = data.cast.apply(lambda x: np.all([x.find(actor) >= 0 for actor in set])).value_counts()
    count = common_films[True] if True in common_films else 0
    result[str(set)] = count
result.sort_values(ascending=False)

['Daniel Radcliffe', 'Rupert Grint']       8
['Johnny Depp', 'Helena Bonham Carter']    6
['Adam Sandler', 'Kevin James']            5
['Vin Diesel', 'Paul Walker']              5
['Hugh Jackman', 'Ian McKellen']           5
dtype: int64

In [457]:
answer_ls.append(5)

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [498]:
directors = data.copy()
directors.director = data.director.str.split("|")
directors = directors.explode("director")
directors_count = directors[["director", "original_title"]].groupby("director").count()
directors_profit_count = directors[directors.profit>0][["director", "profit"]].groupby("director").count()
result = directors_count.merge(directors_profit_count, on="director", how="inner")
result["percent"] = result.profit / result.original_title
result.query("director in ['Quentin Tarantino', 'Steven Soderbergh', 'Robert Rodriguez', 'Christopher Nolan', 'Clint Eastwood']").sort_values(by="percent", ascending=False)

                   original_title  profit   percent
director
Christopher Nolan               8       8  1.000000
Quentin Tarantino               7       6  0.857143
Clint Eastwood                 12      10  0.833333
Steven Soderbergh              13      10  0.769231
Robert Rodriguez               11       8  0.727273

In [492]:
answer_ls.append(4)

# Submission

In [ ]:
len(answer_ls)

In [ ]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])